koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>INTERRUPT</name>
			<description>External interrupts</description>
			<groupName>INTERRUPT</groupName>
			<baseAddress>0x40002420</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x14</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EINT0</name>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>EINT1</name>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>EINT2</name>
				<value>3</value>
			</interrupt>
			<interrupt>
				<name>EINT3</name>
				<value>4</value>
			</interrupt>
			<interrupt>
				<name>EINT4</name>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>EINT5</name>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>EINT6</name>
				<value>7</value>
			</interrupt>
			<interrupt>
				<name>EINT7</name>
				<value>8</value>
			</interrupt>
			<interrupt>
				<name>EINT8</name>
				<value>9</value>
			</interrupt>
			<registers>
				<register>
					<name>EI0CFG</name>
					<description>External Interrupt configuration 0</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IRQ3EN</name>
							<description>External Interrupt 3 enable bit</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>External Interrupt 3 disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>External Interrupt 3 enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ3MDE</name>
							<description>External Interrupt 3 Mode registers</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<description>Rising edge</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<description>Falling edge</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<description>Rising or falling edge</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<description>High level</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<description>Low level</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ2EN</name>
							<description>External Interrupt 2 Enable bit</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>External Interrupt 2 disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>External Interrupt 2 enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ2MDE</name>
							<description>External Interrupt 2 Mode registers</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<description>Rising edge</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<description>Falling edge</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<description>Rising or falling edge</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<description>High level</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<description>Low level</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ1EN</name>
							<description>External Interrupt 1 Enable bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>External Interrupt 0 disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>External Interrupt 0 enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ1MDE</name>
							<description>External Interrupt 1 Mode registers</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<description>Rising edge</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<description>Falling edge</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<description>Rising or falling edge</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<description>High level</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<description>Low level</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ0EN</name>
							<description>External Interrupt 0 Enable bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>External Interrupt 0 disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>External Interrupt 0 enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ0MDE</name>
							<description>External Interrupt 0 Mode registers</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<description>Rising edge</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<description>Falling edge</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<description>Rising or falling edge</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<description>High level</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<description>Low level</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EI1CFG</name>
					<description>External Interrupt configuration 1</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IRQ7EN</name>
							<description>External Interrupt 7 enable bit</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>External Interrupt 7 disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>External Interrupt 7 enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ7MDE</name>
							<description>External Interrupt 7 Mode registers</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<description>Rising edge</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<description>Falling edge</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<description>Rising or falling edge</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<description>High level</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<description>Low level</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ6EN</name>
							<description>External Interrupt 6 Enable bit</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>External Interrupt 6 disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>External Interrupt 6 enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ6MDE</name>
							<description>External Interrupt 6 Mode registers</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<description>Rising edge</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<description>Falling edge</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<description>Rising or falling edge</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<description>High level</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<description>Low level</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ5EN</name>
							<description>External Interrupt 5 Enable bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>External Interrupt 5 disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>External Interrupt 5 enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ5MDE</name>
							<description>External Interrupt 5 Mode registers</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISING</name>
									<description>Rising edge</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Falling edge</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<description>Rising or falling edge</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<description>High level</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<description>Low level</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ4EN</name>
							<description>External Interrupt 4 Enable bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>External Interrupt 4 disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>External Interrupt 4 enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ4MDE</name>
							<description>External Interrupt 4 Mode registers</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<description>Rising edge</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<description>Falling edge</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<description>Rising or falling edge</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<description>High level</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<description>Low level</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EI2CFG</name>
					<description>External Interrupt configuration 2</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IRQ8EN</name>
							<description>External Interrupt 8 Enable bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>External Interrupt 8 disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>External Interrupt 8 enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ8MDE</name>
							<description>External Interrupt 8 Mode registers</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<description>Rising edge</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<description>Falling edge</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<description>Rising or falling edge</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<description>High level</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<description>Low level</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EICLR</name>
					<description>External Interrupt clear</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IRQ8</name>
							<description>External interrupt 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>IRQ7</name>
							<description>External interrupt 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>IRQ6</name>
							<description>External interrupt 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>IRQ5</name>
							<description>External interrupt 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>IRQ4</name>
							<description>External interrupt 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>IRQ3</name>
							<description>External interrupt 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>IRQ2</name>
							<description>External interrupt 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>IRQ1</name>
							<description>External interrupt 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>IRQ0</name>
							<description>External interrupt 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
