koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>WDT</name>
			<description>Watchdog Timer</description>
			<groupName>Timer</groupName>
			<baseAddress>0x40002580</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1C</size>
				<usage>registers</usage>
			</addressBlock>
         <interrupt>
				<name>WDT</name>
				<value>10</value>
			</interrupt>
			<registers>
				<register>
					<name>T3LD</name>
					<description>Load value register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00001000</resetValue>
					<fields>
						<field>
							<name>LOAD</name>
							<description>Load value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T3VAL</name>
					<description>Current count value register</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<access>read-only</access>
					<resetValue>0x00001000</resetValue>
					<fields>
						<field>
							<name>CCOUNT</name>
							<description>Current count value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T3CON</name>
					<description>Control register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x000000E9</resetValue>
					<fields>
						<field>
							<name>MOD</name>
							<description>Timer mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREERUN</name>
									<description>Cleared by user to operate in free running mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIODIC</name>
									<description>Set by user to operate in periodic mode (default).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Timer enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Cleared by user to disable the timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Set by user to enable the timer (default).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>Prescaler</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>Source clock/1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>Source clock/16.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<description>Source clock/256 (default).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4096</name>
									<description>Source clock/4096</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ</name>
							<description>Timer interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Cleared by user to generate a reset on a time out (default).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Set by user to generate an interrupt when the timer times out. This feature is provided for debug purposes and is only available in ACTIVE mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMD</name>
							<description>Power Mode Disable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>The watchdog timer will continue its count down while in hibernate mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>When hibernate mode is entered, the watchdog counter will suspend its count down. As hibernate mode is exited, the count down will resume from its current count value (the count will not be reset).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T3CLRI</name>
					<description>Clear interrupt register</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRWDG</name>
							<description>Clear watchdog</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T3STA</name>
					<description>Status register</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Lock status bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CON</name>
							<description>T3CON write sync in progress</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<description>APB and T3 clock domains T3CON configuration values match</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>APB T3CON register values are being synchronized to T3 clock domain</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LD</name>
							<description>T3LD write sync in progress</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<description>APB and T3 clock domains T3LD values match</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>APB T3LD value is being synchronized to T3 clock domain</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLRI</name>
							<description>T3CLRI write sync in progress</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<description>APB T3CLRI write sync not done/</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>APB T3CLRI write is being synced to T3 clock domain. T3 will be restarted (if 0xCCCC was written) once sync is complete</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
