koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
				<register>
					<name>PLA_DOUT0</name>
					<description>AMBA Bus Data Output for Block 0 and 1</description>
					<addressOffset>0x00000098</addressOffset>
					<size>0x00000010</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
               <field>
                 <name>E15</name>
                 <description>Output bit from Element 15</description>
                 <bitOffset>15</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E14</name>
                 <description>Output bit from Element 14</description>
                 <bitOffset>14</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E13</name>
                 <description>Output bit from Element 13</description>
                 <bitOffset>13</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E12</name>
                 <description>Output bit from Element 12</description>
                 <bitOffset>12</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E11</name>
                 <description>Output bit from Element 11</description>
                 <bitOffset>11</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E10</name>
                 <description>Output bit from Element 10</description>
                 <bitOffset>10</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E9</name>
                 <description>Output bit from Element 9</description>
                 <bitOffset>9</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E8</name>
                 <description>Output bit from Element 8</description>
                 <bitOffset>8</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E7</name>
                 <description>Output bit from Element 7</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E6</name>
                 <description>Output bit from Element 6</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E5</name>
                 <description>Output bit from Element 5</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E4</name>
                 <description>Output bit from Element 4</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E3</name>
                 <description>Output bit from Element 3</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E2</name>
                 <description>Output bit from Element 2</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E1</name>
                 <description>Output bit from Element 1</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E0</name>
                 <description>Output bit from Element 0</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
   				</fields>
				</register>
				<register>
					<name>PLA_DOUT1</name>
					<description>AMBA Bus Data Output for Block 2 and 3</description>
					<addressOffset>0x0000009C</addressOffset>
					<size>0x00000010</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					             <fields>
               <field>
                 <name>E31</name>
                 <description>Output bit from Element 31</description>
                 <bitOffset>15</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E30</name>
                 <description>Output bit from Element 30</description>
                 <bitOffset>14</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E29</name>
                 <description>Output bit from Element 29</description>
                 <bitOffset>13</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E28</name>
                 <description>Output bit from Element 28</description>
                 <bitOffset>12</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E27</name>
                 <description>Output bit from Element 27</description>
                 <bitOffset>11</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E26</name>
                 <description>Output bit from Element 26</description>
                 <bitOffset>10</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E25</name>
                 <description>Output bit from Element 25</description>
                 <bitOffset>9</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E24</name>
                 <description>Output bit from Element 24</description>
                 <bitOffset>8</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E23</name>
                 <description>Output bit from Element 23</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E22</name>
                 <description>Output bit from Element 22</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E21</name>
                 <description>Output bit from Element 21</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E20</name>
                 <description>Output bit from Element 20</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E19</name>
                 <description>Output bit from Element 19</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E18</name>
                 <description>Output bit from Element 18</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E17</name>
                 <description>Output bit from Element 17</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>E16</name>
                 <description>Output bit from Element 16</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
				</register>
				<register>
					<name>PLA_LCK</name>
					<description>Write lock Register. Can only be set once every reset</description>
					<addressOffset>0x000000A0</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Set to disable writing to registers</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Writing to registers allowed</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Writing to registers disabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
