koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
				<register>
             <name>FEEECCCONFIG</name>
             <description>Configurable ECC enable/disable, error response</description>
             <addressOffset>0x00000064</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>INT</name>
                 <description>Interrupt enable when a ECC error happens during an AHB read from program or data flash.</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>2</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>FAULT</name>
                 <description>Signifies when to generate AHB error (HRESP = 1) when an ECC error happens - 1 bit error or 2 bit error.</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>2</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DIS</name>
                 <description>ECC Disable bit.</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>FEEECCADDR0</name>
             <description>Flash 0 ECC Error Address</description>
             <addressOffset>0x00000074</addressOffset>
             <size>0x00000020</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>ADDR0</name>
                 <description>This register has the address of flash0 for which ECC error is detected.</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>19</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0007FFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>FEEECCADDR1</name>
             <description>Flash 1 ECC Error Address</description>
             <addressOffset>0x00000078</addressOffset>
             <size>0x00000020</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>ADDR1</name>
                 <description>This register has the address of flash1 for which ECC error is detected.</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>19</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0007FFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
					<name>CACHESTAT</name>
					<description>Cache Status register</description>
					<addressOffset>0x000000C0</addressOffset>
					<size>0x00000020</size>
					<access>read-only</access>
             <resetValue>0x00000002</resetValue>
             <fields>
               <field>
                 <name>DLOCK</name>
                 <description>This bit is set when D-Cache is locked and cleared when D-cache is unlocked.</description>
                 <bitOffset>18</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DEN</name>
                 <description>If this bit is set then D-Cache is enabled and when cleared D-Cache is disabled. This is also cleared when CACHESTAT[16] is set.</description>
                 <bitOffset>17</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DINIT</name>
                 <description>It is set when D-cache memory initialization starts and clears when initialization is done. D-Cache is disabled when this bit is set.</description>
                 <bitOffset>16</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>ILOCK</name>
                 <description>This bit is set when I-Cache is locked and cleared when I-cache is unlocked.</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>IEN</name>
                 <description>If this bit is set then I-Cache is enabled and when cleared I-Cache is disabled. This is also cleared when CACHESTAT[0] is set.</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>IINIT</name>
                 <description>It is set when I-cache memory initialization starts and clears when initialization is done. I-Cache is disabled when this bit is set.</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
				</register>
				<register>
					<name>CACHESETUP</name>
					<description>Cache Setup register</description>
					<addressOffset>0x000000C4</addressOffset>
					<size>0x00000020</size>
             <resetValue>0x00000002</resetValue>
             <fields>
               <field>
                 <name>DWRBUF</name>
                 <description>If this bit is set, then for every AHB access, hit from WrBuffer is not checked.</description>
                 <bitOffset>19</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>DLOCK</name>
                 <description>If this bit is set, then D-cache contents are locked. Any new misses will not be replaced in D-Cache. This bit is cleared when CACHESETUP[16] is set.</description>
                 <bitOffset>18</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DEN</name>
                 <description>If this bit set, then D-Cache is enabled for AHB accesses. If 0, then D-cache is disabled, and all AHB accesses will be via Flash memory. This bit is cleared when CACHESETUP[16] is set.</description>
                 <bitOffset>17</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DINIT</name>
                 <description>If this bit is set then the D-cache contents are initialized to all zeros. This bit will be cleared once the initialization starts.</description>
                 <bitOffset>16</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>IRDBUF</name>
                 <description>If this bit is set, then for every AHB access, hit from Read Buffer is not checked.</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IWRBUF</name>
                 <description>If this bit is set, then for every AHB access, hit from Write Buffer is not checked.</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ILOCK</name>
                 <description>If this bit is set, then I-cache contents are locked. Any new misses won’t be replaced in I-Cache. This bit is cleared when CACHESETUP[0] is set.</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>IEN</name>
                 <description>If this bit set, then I-Cache is enabled for AHB accesses. If 0, then I-cache is disabled, and all AHB accesses will be via Flash memory. This bit is cleared when CACHESETUP[0] is set.</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>IINIT</name>
                 <description>If this bit is set then the I-cache contents are initialized to all zeros. This bit will be cleared once the initialization starts.</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
				</register>
				<register>
					<name>CACHEKEY</name>
					<description>Cache Key register</description>
					<addressOffset>0x000000C8</addressOffset>
					<size>0x00000020</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>Key</name>
                 <description>Cache Key register</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>32</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
				</register>
