koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>GPIO0</name>
			<description>General Purpose Input Output 0</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x28</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>GP0CON</name>
					<description>GPIO Port 0 configuration</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CON7</name>
							<description>p0.7  configuration bits</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C1SDA</name>
									<description>I2C1 SDA</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLAO3</name>
									<description>PLAO[3]</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON6</name>
							<description>p0.6  configuration bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C1SCL</name>
									<description>I2C1 SCL</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLAO2</name>
									<description>PLAO[2]</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON5</name>
							<description>p0.5  configuration bits</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0SDA</name>
									<description>I2C0 SDA</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLAO1</name>
									<description>PLAO[1]</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON4</name>
							<description>p0.4  configuration bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2CSCL</name>
									<description>I2C0 SCL</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLAO0</name>
									<description>PLAO[0]</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON3</name>
							<description>p0.3  configuration bits</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIOIRQ0</name>
									<description>GPIO/IRQ0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0CS</name>
									<description>SPI0 CS</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLACLK0</name>
									<description>PLA CLK0</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLAI3</name>
									<description>PLAI[3]</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON2</name>
							<description>p0.2  configuration bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0MOSI</name>
									<description>SPI0 MOSI</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLAI2</name>
									<description>PLAI[2]</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON1</name>
							<description>p0.1  configuration bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIP0MISO</name>
									<description>SPI0 MISO</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLAI1</name>
									<description>PLAI[1]</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON0</name>
							<description>p0.0  configuration bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0SCLK</name>
									<description>SPI0 SCLK</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLAI0</name>
									<description>PLAI[0]</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP0OE</name>
					<description>GPIO Port 0 output enable</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
					             <fields>
               <field>
                 <name>OE7</name>
                 <description>Pin output drive enable</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE6</name>
                 <description>Pin output drive enable</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE5</name>
                 <description>Pin output drive enable</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE4</name>
                 <description>Pin output drive enable</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE3</name>
                 <description>Pin output drive enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE2</name>
                 <description>Pin output drive enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE1</name>
                 <description>Pin output drive enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE0</name>
                 <description>Pin output drive enable</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
				<register>
					<name>GP0PUL</name>
					<description>GPIO Port 0 pullup enable</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>PUL7</name>
                 <description>Pin Pull up enable</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL6</name>
                 <description>Pin Pull up enable</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL5</name>
                 <description>Pin Pull up enable</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL4</name>
                 <description>Pin Pull up enable</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL3</name>
                 <description>Pin Pull up enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL2</name>
                 <description>Pin Pull up enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL1</name>
                 <description>Pin Pull up enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL0</name>
                 <description>Pin Pull up enable</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
