koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
				<register>
					<name>GP0IE</name>
					<description>GPIO Port 0 input path enable</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>IEN7</name>
                 <description>Input path enable</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN6</name>
                 <description>Input path enable</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN5</name>
                 <description>Input path enable</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN4</name>
                 <description>Input path enable</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN3</name>
                 <description>Input path enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN2</name>
                 <description>Input path enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN1</name>
                 <description>Input path enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN0</name>
                 <description>Input path enable</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
				<register>
					<name>GP0IN</name>
					<description>GPIO Port 0 registered data input</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000008</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>IN7</name>
                 <description>Registered data input</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN6</name>
                 <description>Registered data input</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN5</name>
                 <description>Registered data input</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN4</name>
                 <description>Registered data input</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN3</name>
                 <description>Registered data input</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN2</name>
                 <description>Registered data input</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN1</name>
                 <description>Registered data input</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN0</name>
                 <description>Registered data input</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
				<register>
					<name>GP0OUT</name>
					<description>GPIO Port 0 data output</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>OUT7</name>
                 <description>Data out</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT6</name>
                 <description>Data out</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT5</name>
                 <description>Data out</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT4</name>
                 <description>Data out</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT3</name>
                 <description>Data out</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT2</name>
                 <description>Data out</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT1</name>
                 <description>Data out</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT0</name>
                 <description>Data out</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                 </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
