koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>GPIO4</name>
			<description>General Purpose Input Output 4</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x40020100</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x28</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>GP4CON</name>
					<description>GPIO Port 4  Configuration</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CON7</name>
							<description>p4.7  configuration bits</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CON6</name>
							<description>p4.6  configuration bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CON5</name>
							<description>p4.5  configuration bits</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CON4</name>
							<description>p4.4  configuration bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CON3</name>
							<description>p4.3  configuration bits</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CON2</name>
							<description>p4.2  configuration bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CON1</name>
							<description>p4.1  configuration bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CON0</name>
							<description>p4.0  configuration bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP4OE</name>
					<description>GPIO Port 4 output enable</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>OE7</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE6</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE5</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE4</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE3</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE2</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE1</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE0</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
				<register>
					<name>GP4PUL</name>
					<description>GPIO Port 4 pull down enable</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>PUL7</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL6</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL5</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL4</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL3</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL2</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL1</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL0</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
				<register>
					<name>GP4IE</name>
					<description>GPIO  Port 4 Input Path Enable</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>IEN7</name>
                 <description>Input path enable</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN6</name>
                 <description>Input path enable</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN5</name>
                 <description>Input path enable</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN4</name>
                 <description>Input path enable</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN3</name>
                 <description>Input path enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN2</name>
                 <description>Input path enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN1</name>
                 <description>Input path enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN0</name>
                 <description>Input path enable</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
