koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
				<register>
					<name>GP5CLR</name>
					<description>GPIO Port 5 data out clear</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000004</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
                 <name>CLR3</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR2</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR1</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
							<name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR0</name>
							<description>Set the output low  for the port pin</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP5TGL</name>
					<description>GPIO Port 5  pin toggle</description>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000004</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
                 <name>TGL3</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
							<name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL2</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL1</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL0</name>
							<description>Toggle the output of the port pin</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP5ODE</name>
					<description>GPIO Port 5  open drain enable</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000004</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
                 <name>ODE3</name>
                 <description>Open drain enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE2</name>
                 <description>Open drain enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE1</name>
                 <description>Open drain enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE0</name>
							<description>Open drain enable</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
					</fields>
				</register>
