koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PWM</name>
			<description>Pulse Width Modulation</description>
			<groupName>PWM</groupName>
			<baseAddress>0x40024000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x50</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PWM_TRIP</name>
				<value>50</value>
			</interrupt>
			<interrupt>
				<name>PWM_PAIR0</name>
				<value>51</value>
			</interrupt>
			<interrupt>
				<name>PWM_PAIR1</name>
				<value>52</value>
			</interrupt>
			<interrupt>
				<name>PWM_PAIR2</name>
				<value>53</value>
			</interrupt>
			<interrupt>
				<name>PWM_PAIR3</name>
				<value>54</value>
			</interrupt>
			<registers>
				<register>
					<name>PWMCON0</name>
					<description>PWM control register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000012</resetValue>
					<fields>
						<field>
							<name>SYNC</name>
							<description>Set to enable PWM synchronization from the SYNC pin of the PWM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Ignore transition from the SYNC pin</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>All PWM counters are reset on the next clock cycle after detection of a falling edge from SYNC pin</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM7INV</name>
							<description>Set to invert PWM7 output</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PWM5INV</name>
							<description>Set to invert PWM5 output</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PWM3INV</name>
							<description>Set to invert PWM3 output</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PWM1INV</name>
							<description>Set to invert PWM1 output</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PWMIEN</name>
							<description>Set to enable interrupts for PWM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>ENA</name>
							<description>When HOFF=0 and HMODE=1 this serves as enable for Pair 0 and 1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Disable Pair 0 and 1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Enable Pair 0 and 1</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMCMP</name>
                 <description>PWM Clock prescaler. Sets HCLK divider.</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV2</name>
                     <description>HCLK/2</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
                     <description>HCLK/4</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
                     <description>HCLK/8</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>HCLK/16</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
                     <description>HCLK/32</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
                     <description>HCLK/64</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
                     <description>HCLK/128</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
                     <description>HCLK/256</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POINV</name>
							<description>Set to invert PWM outputs for Pair 0 and 1 when PWM is in H-bridge mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>HOFF</name>
							<description>Set to turn off the high-side for Pair 0 and 1 when PWM is in H-bridge mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>LCOMP</name>
                 <description>Signal to load a new set of compare register values. In standard mode, this bit is cleared when the new values are loaded in the compare registers for all the channels. In H-bridge mode this bit does not get cleared, but the user must write a value of 1 to this bit in order for the compare registers to be loaded</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Use the values previously store in the compare and length registers</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Load the internal compare registers with values stored in the PWMxCOMx and PWMxLEN registers</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIR</name>
							<description>Direction control when PWM is in H-bridge mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>PWM2 and PWM3 act as output signals while PWM0 and PWM1 are held low</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>PWM0 and PWM1 act as output signals while PWM2 and PWM3 are held low</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HMODE</name>
							<description>Set to enable H-bridge mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PWMEN</name>
							<description>Master enable for PWM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Disable all PWM outputs</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Enable all PWM outputs</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMCON1</name>
					<description>ADC conversion start and trip control register</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TRIP_EN</name>
							<description>Set to enable PWM Trip functionality</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMICLR</name>
					<description>Hardware trip configuration register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TRIP</name>
							<description>Write a 1 to clear latched IRQPWMTrip interrupt. Returns 0 on reads.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PWM3</name>
							<description>Write a 1 to clear latched IRQPWM3 interrupt. Returns 0 on reads.</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PWM2</name>
							<description>Write a 1 to clear latched IRQPWM2 interrupt. Returns 0 on reads.</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PWM1</name>
							<description>Write a 1 to clear latched IRQPWM1 interrupt. Returns 0 on reads.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PWM0</name>
							<description>Write a 1 to clear latched IRQPWM0 interrupt. Returns 0 on reads.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM0COM0</name>
					<description>Compare Register 0 for PWM0 and PWM1</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM0</name>
							<description>Compare register 0 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM0COM1</name>
					<description>Compare Register 1 for PWM0 and PWM1</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM1</name>
							<description>Compare register 1 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM0COM2</name>
					<description>Compare Register 2 for PWM0 and PWM1</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM2</name>
							<description>Compare register 2 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM0LEN</name>
					<description>Period value register for PWM0 and PWM1</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LEN</name>
							<description>Period value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM1COM0</name>
					<description>Compare Register 0 for PWM2 and PWM3</description>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM0</name>
							<description>Compare register 0 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM1COM1</name>
					<description>Compare Register 1 for PWM2 and PWM3</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM1</name>
							<description>Compare register 1 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM1COM2</name>
					<description>Compare Register 2 for PWM2 and PWM3</description>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM2</name>
							<description>Compare register 2 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM1LEN</name>
					<description>Period value register for PWM2 and PWM3</description>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LEN</name>
							<description>Period value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM2COM0</name>
					<description>Compare Register 0 for PWM4 and PWM5</description>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM0</name>
							<description>Compare register 0 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM2COM1</name>
					<description>Compare Register 1 for PWM4 and PWM5</description>
					<addressOffset>0x00000034</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM1</name>
							<description>Compare register 1 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM2COM2</name>
					<description>Compare Register 2 for PWM4 and PWM5</description>
					<addressOffset>0x00000038</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM2</name>
							<description>Compare register 2 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM2LEN</name>
					<description>Period value register for PWM4 and PWM5</description>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LEN</name>
							<description>Period value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM3COM0</name>
					<description>Compare Register 0 for PWM6 and PWM7</description>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM0</name>
							<description>Compare register 0 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM3COM1</name>
					<description>Compare Register 1 for PWM6 and PWM7</description>
					<addressOffset>0x00000044</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM1</name>
							<description>Compare register 1 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM3COM2</name>
					<description>Compare Register 2 for PWM6 and PWM7</description>
					<addressOffset>0x00000048</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COM2</name>
							<description>Compare register 2 data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM3LEN</name>
					<description>Period value register for PWM6 and PWM7</description>
					<addressOffset>0x0000004C</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LEN</name>
							<description>Period value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
