koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CLKCTL</name>
			<description>Clock Gating and Other Settings</description>
			<groupName>Clocking</groupName>
			<baseAddress>0x40028000</baseAddress>
			<addressBlock>
				<offset>0</offset>
         <size>0x1C</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLKCON0</name>
					<description>Misc clock settings register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HFXTALIE</name>
							<description>High frequency crystal interrupt enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>An interrupt to the core will not be generated on a HFXTAL ok or HFXTAL nok</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>An interrupt to the core will be generated on a HFXTAL ok or HFXTAL nok</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPLLIE</name>
							<description>SPLL Interrupt enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>System PLL interrupt will not be generated</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>System PLL interrupt will be generated</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLLMUX</name>
							<description>PLL source selection</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>HFOSC</name>
									<description>Internal oscillator is selected (HFOSC)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFXTAL</name>
									<description>External oscillator is selected (HFXTAL)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKOUT</name>
							<description>GPIO clk out select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>ROOT</name>
                     <description>Root Clock</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>LFOSC</name>
                     <description>(32 kHz)</description>
                     <value>1</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HFOSC</name>
                     <description>(16 MHz)</description>
                     <value>2</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>CORE</name>
                     <description>Core Clock</description>
                     <value>4</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>PCLK</name>
                     <description>PCLK</description>
                     <value>5</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>T0</name>
                     <description>Timer 0 Clock</description>
                     <value>11</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>WUT</name>
                     <description>Wake up Timer Clock</description>
                     <value>12</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HFXTAL</name>
                     <description>HFXTAL</description>
                     <value>14</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
						<field>
							<name>CLKMUX</name>
							<description>Clock mux select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>HFOSC</name>
									<description>High frequency internal oscillator (HFOSC)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPLL</name>
									<description>System PLL is selected (80 MHz)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPLL</name>
									<description>is selected (60 MHz)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTCLK</name>
									<description>External GPIO port is selected (ECLKIN)</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKCON1</name>
					<description>Clock dividers register</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000A82</resetValue>
					<fields>
						<field>
							<name>CDD2DCLK</name>
							<description>D2DCLK divide bits</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>D2D_CLK frequency = HCLK frequency</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>D2D_CLK frequency = half of HCLK frequency</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDPCLK</name>
							<description>PCLK divide bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>Divide by 1 (PCLK is equal to root clock)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>Divide by 2 (PCLK is half the frequency of root clock)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>Divide by 4 (PCLK is quarter the frequency of root clock, 20 MHz)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>Divide by 8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>Divide by 16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<description>Divide by 32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<description>Divide by 164</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<description>Divide by 128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDHCLK</name>
							<description>HCLK divide bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>Divide by 1 (HCLK is equal to root clock)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>Divide by 2 (HCLK is half the frequency of root clock)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>Divide by 4 (HCLK is quarter the frequency of root clock)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>Divide by 8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>Divide by 16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<description>Divide by 32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<description>Divide by 64</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<description>Divide by 128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKCON5</name>
					<description>User clock gating control register</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>D2DCLKOFF</name>
							<description>D2D clock user control</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>ON</name>
									<description>Clock on</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>Clock off</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UCLKUARTOFF</name>
							<description>UART clock user control</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>ON</name>
									<description>Clock on</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>Clock off</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UCLKI2C1OFF</name>
							<description>I2C1 clock user control</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>ON</name>
									<description>Clock on</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>Clock off</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UCLKI2C0OFF</name>
							<description>I2C0 clock user control</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>ON</name>
									<description>Clock on</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>Clock off</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UCLKSPI1OFF</name>
							<description>SPI1 clock user control</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>ON</name>
									<description>Clock on</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>Clock off</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UCLKSPI0OFF</name>
							<description>SPI0 clock user control</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>ON</name>
									<description>Clock on</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>Clock off</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
         <register>
             <name>CLKSTAT0</name>
             <description>Clocking status</description>
             <addressOffset>0x00000018</addressOffset>
             <size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>HFXTALNOK</name>
                 <description>HF crystal not stable</description>
                 <bitOffset>14</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>HFXTALOK</name>
                 <description>HF crystal stable</description>
                 <bitOffset>13</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>HFXTALSTATUS</name>
                 <description>HF crystal status</description>
                 <bitOffset>12</bitOffset>
                 <bitWidth>1</bitWidth>
                 <access>read-only</access>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>SPLLUNLOCK</name>
                 <description>System PLL unlock</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>SPLLLOCK</name>
                 <description>System PLL lock</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>SPLLSTATUS</name>
                 <description>System PLL status</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <access>read-only</access>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
