koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM320.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>VDAC</name>
			<description>VDAC</description>
			<groupName>Analog</groupName>
			<baseAddress>0x40082400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x4024</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DAC0CON</name>
					<description>DAC0 control register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>DAC0 power down</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>EN</name>
							<description>DAC0 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>RN</name>
							<description>DAC0 reference selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC0DAT</name>
					<description>DAC0 data register</description>
					<addressOffset>0x00004004</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>DAC0 data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC1CON</name>
					<description>DAC1 control register</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>DAC1 power down</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>EN</name>
							<description>DAC1 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>RN</name>
							<description>DAC1 reference selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC1DAT</name>
					<description>DAC1 data register</description>
					<addressOffset>0x00004008</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>DAC1 data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC2CON</name>
					<description>DAC2 control register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>DAC2 power down</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>EN</name>
							<description>DAC2 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>RN</name>
							<description>DAC2 reference selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC2DAT</name>
					<description>DAC2 data register</description>
					<addressOffset>0x0000400C</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>DAC2 data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC3CON</name>
					<description>DAC3 control register</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>DAC3 power down</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>EN</name>
							<description>DAC3 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>RN</name>
							<description>DAC3 reference selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC3DAT</name>
					<description>DAC3 data register</description>
					<addressOffset>0x00004010</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>DAC3 data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC4CON</name>
					<description>DAC4 control register</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>DAC4 power down</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>EN</name>
							<description>DAC4 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>RN</name>
							<description>DAC4 reference selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC4DAT</name>
					<description>DAC4 data register</description>
					<addressOffset>0x00004014</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>DAC4 data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC5CON</name>
					<description>DAC5 control register</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>DAC5 power down</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>EN</name>
							<description>DAC5 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>RN</name>
							<description>DAC5 reference selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC5DAT</name>
					<description>DAC5 data register</description>
					<addressOffset>0x00004018</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>DAC5 data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC6CON</name>
					<description>DAC6 control register</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>DAC6 power down</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>EN</name>
							<description>DAC6 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>RN</name>
							<description>DAC6 reference selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC6DAT</name>
					<description>DAC6 data register</description>
					<addressOffset>0x0000401C</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>DAC6 data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC7CON</name>
					<description>DAC7 control register</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>DAC7 power down</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>EN</name>
							<description>DAC7 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>RN</name>
							<description>DAC7 reference selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000003</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DAC7DAT</name>
					<description>DAC7 data register</description>
					<addressOffset>0x00004020</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>DAC7 data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
